""" ============== """
"""  Ввод и вывод  """
""" ============== """

""" Вывод в консоли """
# print(42)                 # Вывод целых чисел
# print("Hello, world!")    # Вывод строковых данных
# print("Привет", "чел!")   # Вывод нескольких параметров через пробел

""" Задание параметров вывода """
# print(1, 2, 3, sep="; ")      # Замена разделителя на "; " вместо пробела по умолчанию
# print("Привет,", end=" ")     # Замена окончания вывода с перевода на новую строку на простой пробел
# print("мир!")

""" Ввод - input() """
print("Привет,", input('Представьтесь: '))  # Вывод пользовательского ввода
# input("Представьтесь!\n")                 # Символ перевода на новую строку - \n
