""" ============ """
"""  Переменные  """
""" ============ """

""" Объявление переменных """
# x = 42        # Объявление и определение переменной - целого числа
# print(x)      # Вывод переменной в консоли
# text = input("Введите строку: ")
# print(text)

""" Изменение значения переменной """
# a = 42
# print(a)
# a = 4
# print(a)

""" Динамическая типизация в Python """
# b = 42            # Сначала b - целое число
# print(b)
# b = "Hello!"      # Затем изменено на тип str - строку
# print(b)

""" Использование переменных для вычисления новых значений """
# c = 15
# d = c * 2
# print("c =", c, "d =", d)

e = 26
e = e + 15
e += 15     # идентично строчке выше
print(e)

""" Арифметические опрерации: """
#   + (сложить),
#   - (вычесть),
#   * (умножить),
#   ** (возведение в степень),
#   / (разделить),
#   % (остаток от деления)
